//
//  DirectHangleMaker.cpp
//  myBooks
//
//  Created by kongbaguni on 2015. 7. 30..
//
//

#include "DirectHangleMaker.h"

static inline std::string changeWstringToDirectString(wchar_t inputWChar)
{
    wchar_t strList[] =
    {
        L'가',L'갸',L'거',L'겨',L'고',L'교',L'구',L'규',L'그',L'기', L'개',L'걔',L'게',L'계',L'괴',L'과',L'괘',L'귀',L'궤',L'긔',L'괘',
        L'까',L'꺄',L'꺼',L'껴',L'꼬',L'꾜',L'꾸',L'뀨',L'끄',L'끼',
        L'나',L'냐',L'너',L'녀',L'노',L'뇨',L'누',L'뉴',L'느',L'니',
        L'다',L'댜',L'더',L'뎌',L'도',L'됴',L'두',L'듀',L'드',L'디',
        L'따',L'땨',L'떠',L'뗘',L'또',L'뚀',L'뚜',L'뜌',L'뜨',L'띠',
        L'라',L'랴',L'러',L'려',L'로',L'료',L'루',L'류',L'르',L'리',
        L'마',L'먀',L'머',L'며',L'모',L'묘',L'무',L'뮤',L'므',L'미',
        L'바',L'뱌',L'버',L'벼',L'보',L'뵤',L'부',L'뷰',L'브',L'비',
        L'빠',L'뺘',L'뻐',L'뼈',L'뽀',L'뾰',L'뿌',L'쀼',L'쁘',L'삐',
        L'사',L'샤',L'서',L'셔',L'소',L'쇼',L'수',L'슈',L'스',L'시',
        L'싸',L'쌰',L'써',L'쎠',L'쏘',L'쑈',L'쑤',L'쓔',L'쓰',L'씨',
        L'아',L'야',L'어',L'여',L'오',L'요',L'우',L'유',L'으',L'이',
        L'자',L'쟈',L'저',L'져',L'조',L'죠',L'주',L'쥬',L'즈',L'지',
        L'짜',L'쨔',L'쩌',L'쪄',L'쪼',L'쬬',L'쭈',L'쮸',L'쯔',L'찌',
        L'차',L'챠',L'처',L'쳐',L'초',L'쵸',L'추',L'츄',L'츠',L'치',
        L'카',L'캬',L'커',L'켜',L'코',L'쿄',L'쿠',L'큐',L'크',L'키',
        L'타',L'탸',L'터',L'텨',L'토',L'툐',L'투',L'튜',L'트',L'티',
        L'파',L'퍄',L'퍼',L'펴',L'포',L'표',L'푸',L'퓨',L'프',L'피',
        L'하',L'햐',L'허',L'혀',L'호',L'효',L'후',L'휴',L'흐',L'히',
        
        L'각',L'갹',L'걱',L'격',L'곡',L'굑',L'국',L'귝',L'극',L'긱', L'깍',L'꺅',L'꺽',L'껵',L'꼭',L'꾝',L'꾹',L'뀩',L'끅',L'끽',
        L'각',L'냑',L'넉',L'녁',L'녹',L'뇩',L'눅',L'뉵',L'늑',L'닉',
        L'닥',L'댝',L'덕',L'뎍',L'독',L'됵',L'둑',L'듁',L'득',L'딕', L'딱',L'땩',L'떡',L'뗙',L'똑',L'뚁',L'뚝',L'뜍',L'뜩',L'띡',
        L'락',L'략',L'럭',L'력',L'록',L'룍',L'룩',L'륙',L'륵',L'릭',
        L'막',L'먁',L'먹',L'멱',L'목',L'묙',L'묵',L'뮥',L'믁',L'믹',
        L'박',L'뱍',L'벅',L'벽',L'복',L'뵥',L'북',L'뷱',L'븍',L'빅', L'빡',L'뺙',L'뻑',L'뼉',L'뽁',L'뾱',L'뿍',L'쀽',L'쁙',L'삑',
        L'삭',L'샥',L'석',L'셕',L'속',L'쇽',L'숙',L'슉',L'슥',L'식', L'싹',L'쌱',L'썩',L'쎡',L'쏙',L'쑉',L'쑥',L'쓕',L'쓱',L'씩',
        L'악',L'약',L'억',L'역',L'옥',L'욕',L'욱',L'육',L'윽',L'익',
        L'자',L'쟈',L'저',L'져',L'조',L'죠',L'주',L'쥬',L'즈',L'지', L'짝',L'쨕',L'쩍',L'쪅',L'쪽',L'쬭',L'쭉',L'쮹',L'쯕',L'찍',
        L'착',L'챡',L'척',L'쳑',L'촉',L'쵹',L'축',L'츅',L'측',L'칙',
        L'칵',L'캭',L'컥',L'켝',L'콕',L'쿅',L'쿡',L'큑',L'큭',L'킥',
        L'탁',L'탹',L'턱',L'텩',L'톡',L'툑',L'툭',L'튝',L'특',L'틱',
        L'팍',L'퍅',L'퍽',L'펵',L'폭',L'푝',L'푹',L'퓩',L'픅',L'픽',
        L'학',L'햑',L'헉',L'혁',L'혹',L'횩',L'훅',L'휵',L'흑',L'힉',
        
        //        L'',L'',L'',L'',L'',L'',L'',L'',L'',L'',
        //        L'',L'',L'',L'',L'',L'',L'',L'',L'',L'',
        //        L'',L'',L'',L'',L'',L'',L'',L'',L'',L'',
        //        L'',L'',L'',L'',L'',L'',L'',L'',L'',L'',
        //        L'',L'',L'',L'',L'',L'',L'',L'',L'',L'',
        //        L'',L'',L'',L'',L'',L'',L'',L'',L'',L'',
        //        L'',L'',L'',L'',L'',L'',L'',L'',L'',L'',
        //        L'',L'',L'',L'',L'',L'',L'',L'',L'',L'',
        //        L'',L'',L'',L'',L'',L'',L'',L'',L'',L'',
        //        L'',L'',L'',L'',L'',L'',L'',L'',L'',L'',
        
    };
    std::string returnStrList[] =
    {
        /*
         초성
         ㄱ ㄴ ㄷ ㄹ ㅁ ㅂ ㅅ ㅇ ㅈ ㅊ ㅋ ㅌ ㅍ ㅎ
         k  h u  y i  ; n j l  o  0 ' p  m
         
         중성
         ㅏ ㅑ ㅓ ㅕ ㅗ ㅛ ㅜ ㅠ ㅡ ㅣ ㅐ ㅒ ㅔ ㅖ ㅘ  ㅚ   ㅙ  ㅝ   ㅟ   ㅞ
         f  6 t  e v 4  b 5 g  d  r    c   vf  vd  vd  bt  bd  bc
         
         종성
         ㄱ ㄴ ㄷ ㄹ ㅁ ㅂ ㅅ ㅇ ㅈ ㅊ ㅋ ㅌ ㅍ ㅎ
         
         */
        
        //kf k6 kt ke kv k4 kb k5 kg kd kr
//        L'가',L'갸',L'거',L'겨',L'고',L'교',L'구',L'규',L'그',L'기', L'개',L'걔',L'게',L'계',L'괴',L'과',L'괘',L'귀',L'궤',L'긔',L'괘',
        "kf","k6","kt","ke","kv","k4","kb","k5","kg","kd","kr","","","","","","","","","","",
        "까","꺄","꺼","껴","꼬","꾜","꾸","뀨","끄","끼",
        "나","냐","너","녀","노","뇨","누","뉴","느","니",
        "다","댜","더","뎌","도","됴","두","듀","드","디", "따","땨","떠","뗘","또","뚀","뚜","뜌","뜨","띠",
        "라","랴","러","려","로","료","루","류","르","리",
        "마","먀","머","며","모","묘","무","뮤","므","미",
        "바","뱌","버","벼","보","뵤","부","뷰","브","비", "빠","뺘","뻐","뼈","뽀","뾰","뿌","쀼","쁘","삐",
        "사","샤","서","셔","소","쇼","수","슈","스","시", "싸","쌰","써","쎠","쏘","쑈","쑤","쓔","쓰","씨",
        "아","야","어","여","오","요","우","유","으","이",
        "자","쟈","저","져","조","죠","주","쥬","즈","지", "짜","쨔","쩌","쪄","쪼","쬬","쭈","쮸","쯔","찌",
        "차","챠","처","쳐","초","쵸","추","츄","츠","치",
        "카","캬","커","켜","코","쿄","쿠","큐","크","키",
        "타","탸","터","텨","토","툐","투","튜","트","티",
        "파","퍄","퍼","펴","포","표","푸","퓨","프","피",
        "하","햐","허","혀","호","효","후","휴","흐","히",
        
        "각","갹","걱","격","곡","굑","국","귝","극","긱", "깍","꺅","꺽","껵","꼭","꾝","꾹","뀩","끅","끽",
        "각","냑","넉","녁","녹","뇩","눅","뉵","늑","닉",
        "닥","댝","덕","뎍","독","됵","둑","듁","득","딕", "딱","땩","떡","뗙","똑","뚁","뚝","뜍","뜩","띡",
        "락","략","럭","력","록","룍","룩","륙","륵","릭",
        "막","먁","먹","멱","목","묙","묵","뮥","믁","믹",
        "박","뱍","벅","벽","복","뵥","북","뷱","븍","빅", "빡","뺙","뻑","뼉","뽁","뾱","뿍","쀽","쁙","삑",
        "삭","샥","석","셕","속","쇽","숙","슉","슥","식", "싹","쌱","썩","쎡","쏙","쑉","쑥","쓕","쓱","씩",
        "악","약","억","역","옥","욕","욱","육","윽","익",
        "자","쟈","저","져","조","죠","주","쥬","즈","지", "짝","쨕","쩍","쪅","쪽","쬭","쭉","쮹","쯕","찍",
        "착","챡","척","쳑","촉","쵹","축","츅","측","칙",
        "칵","캭","컥","켝","콕","쿅","쿡","큑","큭","킥",
        "탁","탹","턱","텩","톡","툑","툭","튝","특","틱",
        "팍","퍅","퍽","펵","폭","푝","푹","퓩","픅","픽",
        "학","햑","헉","혁","혹","횩","훅","휵","흑","힉",
        
        "","","","","","","","","","",
        "","","","","","","","","","",
        "","","","","","","","","","",
        "","","","","","","","","","",
        "","","","","","","","","","",
        "","","","","","","","","","",
        "","","","","","","","","","",
        "","","","","","","","","","",
        "","","","","","","","","","",
        "","","","","","","","","","",
    };
    
    
    for (int i=0; i<sizeof(strList)/sizeof(std::wstring); i++)
    {
        bool isMatch = strList[i] == inputWChar;
        if (isMatch)
        {
            return returnStrList[i];
        }
    }
    return "B";
    
}
std::string DirectHangleMaker::makeDirect(std::wstring inputString)
{
    std::string result;
    CCLOG("%lu",inputString.length());
    for (int i=0; i<inputString.length(); i++)
    {
        result+=changeWstringToDirectString(inputString[i]);
    }
    return result;
}